Tekla Open API Reference for Tekla Structures 2025
IHasChildren Interface
 The IHasChildren interface is implemented by objects that have child objects.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public interface IHasChildren
Public Interface IHasChildren
Methods
Name | Description
GetObjects()
 Gets the children of the current object.
GetObjects(Type[])
 Gets the children of the current object that are of certain types.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace